---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AnalyticalElement
source: html/e5afd723-f20a-caea-ff6b-535678f61272.htm
---
# AnalyticalElement Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.